#+TITLE: Introduction to Rcpp
#+AUTHOR: Marcus Birkenkrahe
#+SUBTITLE: Introduction to Advanced Data Science DSC 205 - Spring 2025
#+OPTIONS: toc:nil
#+STARTUP: overview hideblocks indent

* Evaluating Simple C++ with =evalCpp=

- =evalCpp= evaluates one-line C++ expressions inside R.
- Useful for quick experiments.

#+begin_src R :session *R* :results output :exports both
  library(Rcpp)

  evalCpp("40 + 2")
  evalCpp("exp(1.0)")
  evalCpp("sqrt(4.0)")
  evalCpp("std::numeric_limits<int>::max()")
#+end_src

#+RESULTS:
: [1] 42
: [1] 2.718282
: [1] 2
: [1] 2147483647

- *Important*: C++ distinguishes integers and doubles carefully.
- Integer division:
  #+begin_src R :session *R* :results output :exports both
  evalCpp("13 / 4")            # 3 (integer division)
  evalCpp("(double)13 / 4")    # 3.25 (floating point division)
#+end_src

#+RESULTS:
: [1] 3
: [1] 3.25

* Quick Example

- Multiply a vector by two.

- Write it as an R script:
  #+begin_src R :session *R* :results output :exports both
                                            # Load Rcpp
    library(Rcpp)

    ## Define C++ function `timesTwo`
    Rcpp::cppFunction('
    NumericVector timesTwo(NumericVector x) {
          return x * 2;
        }')

    ## Function call
    timesTwo(c(1,2,3))
  #+end_src

  #+RESULTS:
  : [1] 2 4 6

- Check out the function code:
  #+begin_src R :session *R* :results output :exports both
    timesTwo
  #+end_src

  #+RESULTS:
  : function (x)
  : .Call(<pointer: 0x715ecd743520>, x)

- Compare the R standard with the compiled function for a very large
  vector:
  #+begin_src R :session *R* :results output :exports both
    x <- runif(1e9)
    system.time(x * 2)
    system.time(timesTwo(x))
  #+end_src

  #+RESULTS:
  : user  system elapsed
  :   0.535   1.200   1.735
  : user  system elapsed
  :   0.748   1.195   1.943

- Alternatively, you can also write a C++ file, compile and load it
  with ~sourceCpp~ in an R script.

  1) Tangle C++ program
     #+begin_src C++ :tangle two.cpp :main no :includes
       #include <Rcpp.h>
       using namespace Rcpp;

       // [[Rcpp::export]]
       NumericVector timesTwo2(NumericVector x) {
         return x * 2;
       }
     #+end_src

  2) Compile, load and run function in R:
     #+begin_src R :session *R* :results output :exports both
       library(Rcpp)

       ## Compile and load
       sourceCpp(file="two.cpp")

       ## Now call the function
       timesTwo2(c(1,2,3,4))
     #+end_src

     #+RESULTS:
     : [1] 2 4 6 8

